{
  "metadata": {
    "type": "software"
  },
  "about": {
    "name": "Michael Hill",
    "email": "blacknight.mah0023@gmail.com",
    "phone": "256-541-5232",
    "github": "https://github.com/blacknight2006",
    "clearance": "Active DoD Secret",
    "summary": "USAF Veteran with more than 17 years of combined experience (Air Force, NASA & Army), I bring a wealth of IT and engineering experience, leadership, analytical knowledge, attention to detail, a collaborative mindset, conflict resolution and determination to any project, producing quality solutions and products.  I lead a team of ~40 FTEs to develop, test, integrate and sustain software for the Army called Precision Fires Manager (PFM). I provide direction in tasking, product design (UI and SW Architecture) and assist with ensuring the project stays on schedule and budget. I also assist with product interactions/integration efforts to help grow the customer base and ensure project longevity."
  },
  "experience": [
	{
	  "company": "SAIC",
      "link": "https://www.saic.com/",
      "location": "Huntsville, AL",
      "date": "June 2016 - Present",
      "projects": [
        {
          "name": "Precision Fires Manager (PFM)",
          "date": "March 2019 - Present",
          "role": "CAP Lead and Software Systems Engineer: FULL Time",
          "description": "Precision Fires Manager (PFM) is a Quick Fires Software (QFS) that ingests sensor nominated target locations and refines them to Precision Guided Munition (PGM) quality target locations. It is an integrated application that provides a common access point for sensor and/or user data for detection and/or target lists, maneuver units and organic weapon systems that operate at Forward Operating Bases (FOBs), Tactical Operations Centers (TOCs) and Combat Outposts (COPs) that is designed to connect persistent surveillant systems with smart munitions for the Army.",
          "skills": {
            "languages": ["typescript"],
            "technologies": ["aurelia", "gdal", "gulp", "npm", "rest", "tls", "nodejs", "gdal"],
            "tools": ["windows", "git", "jira", "uml", "visualstudio"],
            "data": ["mongodb", "postgres"],
            "processes": ["agile"]
          },
          "work": [
            "Senior member on a team of 3 CAP Leads",
            "Assist SW Manager and Chief Architect in leading a team of 13 developers and 4 testers",
            "Plan and coordinate software releases for PFM",
            "Create and Prioritize Capability Assessment Packages (CAPs) for releases",
            "Plan, schedule and create tasks for developers and testers on the team",
            "Create and maintain software release documentation (SDD, ICD, SRS, etc.)",
            "Brief status updates to management on CAP & development progress during a release cycle",
            "Lead requirements analysis and schedule management",
            "Provide input and help review PFM-related documentation (STD, STP, PP, FHA, PHA, etc.)",
            "Coordinate changes to project schedule, milestones and documentation",
            "Create and update design models and documentation",
	    "Member of SWCCB to assist leadership in assessments of bugs and defects",
	    "Key contributor to CAP risk assessment and risk mitigation",
            "Create and maintain weekly project reporting updates to management and other stakeholders",
            "POC for PFM Engineering when coordinating between other internal groups (MA, Cyber, etc.)"
          ],
          "accomplishments": [
            "Assisted in the implementation and release of the PFM v1.0.0.0 application", "Re-Certified on CompTIA Security+ CE"
          ]
        },
        {
          "name": "NASA EAST2 Contract",
          "date": "June 2016 - March 2019",
          "role": "Software Engineer and Server Administrator: FULL Time",
          "description": "Employed to build, maintain and upgrade multiple application environments, ensuring 99.9% or better uptime with an emphasis on availability, reliability, scalability, data confidentiality and system integrity.",
          "skills": {
            "languages": ["bash", "html", "xml"],
            "technologies": ["remedy", "maximo", "siteminder", "adfs", "apigateway", "sharepoint", "sso"],
            "tools": ["windows", "git", "jira", "uml", "visualstudio", "linux"],
            "data": ["mongodb", "mssql"],
            "processes": ["waterfall"]
          },
          "work": [
            "Performed application and server tests to validate operations",
            "Createed and maintain server scripts to perform and report various tasks and statuses",
            "Trained co-workers on new applications",
            "Provided on-call support as required",
            "Analyzed and reduced performance issues with NASA applications and servers",
            "Validated and migrated developer code to different enrivonments (dev, test, stage, production)",
            "Coordinated and scheduled NASA application activities",
            "Performed software patching and OS kernel updates",
            "Diagnosed and resolved application, server and certificate vulnerabilities",
            "Designed new RHEL architecture and created UML diagram documentation",
            "Increased application uptime by developing automation for server reboots, post patching activities",
            "Analyzed database queries for reports and issues within the applications",
            "Maintained privileges access to servers and applications",
            "SharePoint administration and site design experience",
            "Created and updated documentation for applications, scans, daily tasks, vulnerabilities (POA&Ms) and Root-Cause analyses",
            "Analyzed current application and OS setup for possible architecture improvements",
            "Designed and created application logos per customer requirements"
          ],
          "accomplishments": [
            "MSFC CIO Achiever Award for the implementation of EZMax Mobile",
            "MSFC Group Achievement Award for the EZMax Mobile Team"
          ]
        }
      ]
    },
    {
      "company": "Dynetics Technical Services (DTS)",
      "link": "https://www.dynetics.com/",
      "location": "Huntsville, AL",
      "date": "June 2013 - June 2016",
      "projects": [
        {
          "name": "NASA MITS Contract",
          "date": "June 2013 - June 2016",
          "role": "Remedy and Maximo Developer: FULL Time",
          "description": "Remedy and Maximo are ticketing applications that provide: incident, problem, knowledge, change, release, asset, configuration and service level management; while providing the users with smart reporting capabilities.",
          "skills": {
            "languages": ["javascript", "html", "css", "bash", "xml"],
            "technologies": ["remedy", "maximo", "sso", "rest", "tls", "vm"],
            "tools": ["windows", "rhel"],
            "data": ["mongodb", "mssql"],
            "processes": ["agile", "waterfall"]
          },
          "work": [
            "Created and maintained development documentation for testing and reports for management and NASA customers",
            "Trained customers to use the Remedy and Maximo applications",
            "Provided customer support for incidents and other technical issues",
	    "Configured Maximo and Remedy applications to meet customer requirements",
	    "Provided server support for planned activities and maintenance",
            "Designed, planed and executed RHEL architecture VM migrations",
            "Designed and executed Remedy high-availability architecture upgrade",
            "Implemented Remedy internal health monitor utility",
            "Monitored server and application performance",
            "Designed and created application logos per customer requirements",
            "Provided project status updates to management and team members"
          ],
          "accomplishments": [
            "Certificate of Team Appreciation for the BMC Remedy v9.0 Upgrade Project"
          ]
        }
      ]
    },
    {
      "company": "United States Air Force - Air National Guard (ANG)",
      "link": "https://www.goang.com",
      "location": "",
      "date": "November 2006 - November 2012",
      "projects": [
        {
          "name": "118th AW: Client Systems Operations (3D1X1) in Nashville, TN",
          "date": "October 2007 - November 2012",
          "role": "Client Systems Operator: PART Time",
          "description": "Computer networking specialist, responsible for deployment, sustainment, troubleshooting and repair of standard voice, data, video and cryptographic client devices.",
          "skills": {
            "languages": ["javascript", "html", "cpp"],
            "technologies": ["remedy", "solarWinds", "tls"],
            "tools": ["windows", "uml", "notepad++", "hailstorm"],
            "data": ["mssql"],
            "processes": []
          },
          "work": [
            "Senior member of the 118th AW Help Desk on team of 4",
	    "Coordinated and conducted training of subordinates and reported statuses to Chief Client Operator",
	    "Provided training updates to documentation",
	    "Created/maintained base network diagrams",
            "Provided customer support with BMC Remedy application",
            "Maintained user records and access privileges using Active Directory",
	    "Created and maintained base data backup procedures",
            "Created and maintained firewall and security protocols for base network",
            "Maintained applications on base by configuring and applying regular security patches",
            "Created and maintained base network diagrams for SolarWinds (computers, printers, faxes and phones)",
            "Trained personnel on system administration"
          ],
          "accomplishments": [
            "Acquired 5-level in 3C2X1 field in 3D1X1 field",
            "Completed Airman Leadership School (ALS) training",
            "Obtained rank of Staff Sergeant",
            "Obtained CompTIA Security+ Certification"
          ]
        },
        {
          "name": "225th CBCS: Technical Controlman (3C2X1) in Gadsden, AL",
          "date": "November 2006 - October 2007",
          "role": "Communications - Computer Systems Controller: PART Time",
          "description": "Monitor and control performance of networks and communications-computer systems (C-CS). Coordinates configuration, operation, restoration and service improvements, as well as to analyze capabilities & performance, identify problems and take corrective actions to resolve any issue that arises.",
          "skills": {
            "languages": [],
            "technologies": [],
            "tools": [],
            "data": [],
            "processes": []
          },
          "work": [
            "Network administrator using Active Directory to manage user access",
            "Install and configure Cisco routers, switches and hubs across base",
            "Install and test server hardware for upgrades",
            "Secure-wiped obsolete computers and harddrives per DoD regulations",
            "Maintain database records and server backups",
            "Perpare 225th CBCS Base for closure"
          ],
          "accomplishments": [
            "Completed 3C2X1 Tech School and acquired 3-level"
          ]
        }
      ]
    }
  ],
  "projects": [
    {
      "name": "NISM: Report Audit Tracking",
      "description": "This module was created to provide advanced reporting and scheduling capabilities, to the user, that worked in conjunction with the included reporting application.",
      "skills": {
        "languages": ["javascript"],
        "technologies": ["remedy", "nism"],
        "tools": [],
        "data": ["mssql"],
        "processes": []
      }
    },
    {
      "name": "NISM: Heartbeat Oversight Form",
      "description": "This module, in the NISM application, was created to track the health of the servers and NISM processes running on the servers. It then stores that data and sends a notification to the development team when performance anomalies are encountered.",
      "skills": {
        "languages": ["javascript"],
        "technologies": ["remedy", "nism"],
        "tools": [],
        "data": ["mssql"],
        "processes": []
      }
    }
  ],
  "education": [
    {
      "school": "University of Alabama in Huntsville (UAH)",
      "link": "https://www.uah.edu/",          
      "location": "Huntsville, AL",
      "date": "2008 - 2013"
      "degree": "B.S. in Computer Science with minor in Mathematics"
    },
    {
      "school": "Community College of the Air Force (CCAF)",
      "link": "https://www.airuniversity.af.edu/Barnes/CCAF/",
      "location": "Maxwell AFB, AL",
      "date": "2007 - 2011",
      "degree": "A.S. in Electronics Systems Techonology"
    },
    {
      "school": "CompTIA Security+ CE",
      "link": "https://www.comptia.org/",
      "location": "Huntsville, AL",
      "date": "2021 - Present",
      "credential id": "COMP001020141560"
    }
  ]
}
