{
  "metadata": {
    "type": "software"
  },
  "about": {
    "name": "Michael Hill",
    "email": "mah0023@alumni.uah.edu",
    "phone": "256-541-5232",
    "github": "https://github.com/blacknight2006",
    "clearance": "Active DoD Secret",
    "summary": "Multitasking Systems Engineer and Technical/CAP Lead with skills in scripting automation, application and OS troubleshooting/patching and server security mitigations looking for a challenging and fulfilling role to further my skills in project leadership, systems engineering, systems/OS administration and/or IT security.  With more than 13 years of combined experience (Air Force, and contractor positions with NASA and Army), I bring analytical knowledge, attention to detail, skill, a collaborative mindset, conflict resolution and determination to any project, producing quality solutions and products."
  },
  "experience": [
	{
	  "company": "SAIC",
      "link": "https://www.saic.com/",
      "location": "Huntsville, AL",
      "date": "June 2016 - Present",
      "projects": [
        {
          "name": "Precision Fires Manager (PFM)",
          "date": "March 2019 - Present",
          "role": "CAP Lead and Software Systems Engineer",
          "description": "PFM is a communication application designed to connect persistent survellant systems with smart munitions for the Army.",
          "skills": {
            "languages": ["typescript"],
            "technologies": ["aurelia", "gdal", "gulp", "npm", "rest", "tls", "nodejs", "gdal"],
            "tools": ["windows", "git", "jira", "uml", "visualstudio"],
            "data": ["mongodb", "postgres"],
            "processes": ["agile"]
          },
          "work": [
            "Senior member on a team of 3 CAP Leads",
            "Assist SW Manager and Chief Architect in leading a team of 12 developers and 4 testers",
            "Plan and coordinate software releases for PFM",
            "Create and Prioritize Capability Assessment Packages (CAPs) for releases",
            "Plan and create tasks for developers and testers on the team",
            "Create and maintain software release documentation (SDD, ICD, SRS, etc.)",
            "Create, maintain and brief status updates to management",
            "Lead requirements analysis and schedule management",
            "Provide input and review PFM-related documentation (STD, STP, PP, FHA, PHA, etc.)",
            "Coordinate changes to project schedule, milestones and documentation",
            "Create and update design models and documentation",
            "Assess critical issues and provide impact analysis",
            "Provide input for CAP risk assessment and risk mitigation"
          ],
          "accomplishments": [
            "Assisted in the implementation and release of the PFM v1.0.0.0 application"
          ]
        },
        {
          "name": "NASA EAST2 Contract",
          "date": "June 2016 - March 2019",
          "role": "Software Engineer and Server Administrator",
          "description": "Employed to build, maintain and upgrade multiple application environments, ensuring 99.9% or better uptime with an emphasis on availability, reliability, scalability, data confidentiality and system integrity.",
          "skills": {
            "languages": ["bash", "html", "xml"],
            "technologies": ["remedy", "maximo", "siteminder", "adfs", "apigateway", "sharepoint", "sso"],
            "tools": ["windows", "git", "jira", "uml", "visualstudio", "linux"],
            "data": ["mongodb", "mssql"],
            "processes": ["waterfall"]
          },
          "work": [
            "Perform application and server tests to validate operations",
            "Create and maintain server scripts to perform and report various tasks and statuses",
            "Train co-workers on new applications",
            "Provide on-call support as required",
            "Analyze and reduce performance issues with NASA applications and servers",
            "Validate and migrate developer code to different enrivonments (dev, test, stage, production)",
            "Coordinate and schedule NASA application activities",
            "Perform software patching and OS kernel updates",
            "Diagnose and resolve application, server and certificate vulnerabilities",
            "Designed new RHEL architecture and created UML diagram documentation",
            "Increased application uptime by developing automation for server reboots, post patching activities",
            "Analyze database queries for reports and issues within the applications",
            "Maintain privileges access to servers and applications",
            "SharePoint administration and site design experience",
            "Create and update documentation for applications, scans, daily tasks, vulnerabilities (POA&Ms) and Root-Cause analyses",
            "Analyze current application and OS setup for possible architecture improvements",
            "Design and create application logos per customer requirements"
          ],
          "accomplishments": [
            "MSFC CIO Achiever Award for the implementation of EZMax Mobile",
            "MSFC Group Achievement Award for the EZMax Mobile Team"
          ]
        }
      ]
    },
    {
      "company": "Dynetics Technical Services (DTS)",
      "link": "https://www.dynetics.com/",
      "location": "Huntsville, AL",
      "date": "June 2013 - June 2016",
      "projects": [
        {
          "name": "NASA MITS Contract",
          "date": "June 2013 - June 2016",
          "role": "Remedy and Maximo Developer",
          "description": "Remedy and Maximo are ticketing applications that provide: incident, problem, knowledge, change, release, asset, configuration and service level management; while providing the users with smart reporting capabilities.",
          "skills": {
            "languages": ["javascript", "html", "css", "bash", "xml"],
            "technologies": ["remedy", "maximo", "sso", "rest", "tls", "vm"],
            "tools": ["windows", "rhel", "nism"],
            "data": ["mongodb", "mssql"],
            "processes": ["agile", "waterfall"]
          },
          "work": [
            "Create and maintain development documentation for testing and reports for management and NASA customers",
            "Train customers to use the Remedy and Maximo applications",
            "Provide customer support for incidents and other technical issues",
            "Design, plan and execute RHEL architecture VM migrations",
            "Design and execute Remedy high-availability architecture upgrade",
            "Implement Remedy internal health monitor utility",
            "Monitor server and application performance",
            "Design and create application logos per customer requirements",
            "Provide project status updates to management and team members"
          ],
          "accomplishments": [
            "Certificate of Team Appreciation for the BMC Remedy v9.0 Upgrade Project"
          ]
        }
      ]
    },
    {
      "company": "United States Air Force - Air National Guard (ANG)",
      "link": "https://www.goang.com",
      "location": "",
      "date": "November 2006 - November 2012",
      "projects": [
        {
          "name": "118th AW: Client Systems Operations (3D1X1) in Nashville, TN",
          "date": "October 2007 - November 2012",
          "role": "Client Systems Operator",
          "description": "Computer networking specialist, responsible for deployment, sustainment, troubleshooting and repair of standard voice, data, video and cryptographic client devices.",
          "skills": {
            "languages": ["javascript", "html", "cpp"],
            "technologies": ["remedy", "solarWinds", "tls"],
            "tools": ["windows", "uml", "notepad++", "hailstorm"],
            "data": ["mssql"],
            "processes": []
          },
          "work": [
            "Lead small team of 2 Client Operators and reported statuses to Chief Client Operator",
            "Provide customer support with BMC Remedy application",
            "Maintained user records and access privileges using Active Directory",
            "Create and maintain firewall and security protocols for base network",
            "Maintain applications on base by configuring and applying regular security patches",
            "Create and maintain base network diagrams for SolarWinds (computers, printers, faxes and phones)",
            "Train personnel on system administration"
          ],
          "accomplishments": [
            "Acquired 5-level in 3C2X1 field in 3D1X1 field",
            "Completed Airman Leadership School (ALS) training",
            "Obtained rank of Staff Sergeant",
            "Obtained CompTIA Security+ Certification"
          ]
        },
        {
          "name": "225th CBCS: Technical Controlman (3C2X1) in Gadsden, AL",
          "date": "November 2006 - October 2007",
          "role": "Technical Controlman",
          "description": "Monitor and control performance of networks and communications-computer systems (C-CS). Coordinates configuration, operation, restoration and service improvements, as well as to analyze capabilities & performance, identify problems and take corrective actions to resolve any issue that arises.",
          "skills": {
            "languages": [],
            "technologies": [],
            "tools": [],
            "data": [],
            "processes": []
          },
          "work": [
            "Network administrator using Active Directory to manage user access",
            "Install and configure Cisco routers, switches and hubs across base",
            "Install and test server hardware for upgrades",
            "Secure-wiped obsolete computers and harddrives per DoD regulations",
            "Maintain database records and server backups",
            "Perpare 225th CBCS Base for closure"
          ],
          "accomplishments": [
            "Completed 3C2X1 Tech School and acquired 3-level"
          ]
        }
      ]
    }
  ],
  "projects": [
    {
      "name": "Fleet Driver Service",
      "description": "Truck driver application processing program.",
      "skills": {
        "languages": [],
        "technologies": [],
        "tools": [],
        "data": [],
        "processes": []
      }
    }
  ],
  "education": [
    {
      "school": "University of Alabama in Huntsville (UAH)",
      "link": "https://www.uah.edu/",
      "location": "Huntsville, AL",
      "date": "2008 - 2013",
      "degree": "B.S. in Computer Science with minor in Mathematics"
    },
    {
      "school": "Community College of the Air Force (CCAF)",
      "link": "https://www.airuniversity.af.edu/Barnes/CCAF/",
      "location": "Maxwell AFB, AL",
      "date": "2007 - 2011",
      "degree": "A.S. in Electronics Systems Techonology"
    }
  ]
}
